Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/legal_options_following_marital_breakdown.html.txt.tmx
Source language: en
Languages: ga

source: Legal options following marital breakdown
ga: Torthaí ar Scaradh nó Colscaradh

source: When a marriage first breaks up, many couples informally separate and live apart
ga: Nuair a theipeann ar phósadh ar dtús, is iondúil go scarann lanúin agus go gcónaíonn siad ó chéile

source: Marital breakdown affects all areas of a person' s life, and most people go on to regulate matters between them in a legal context
ga: Bíonn tionchar ar bhriseadh an phósta ar chuile ghné de shaol an duine agus téann an chuid is mó daoine ar aghaidh le rudaí a shocrú eatarthu go dleathúil

source: There are three different ways of doing this in Ireland:
ga: Tá trí bhealach ann len é seo a dhéanamh in Éirinn:

source: A separation agreement is reached through agreement between the parties, whereas a court grants a judicial separation or a divorce
ga: Tagann an lanúin iad féin chuig na socruithe a bhaineann le socrú scartha, ach bíonn socrú cúirte i gceist le scaradh dleathúil agus colscaradh

source: Of these, only a decree of divorce dissolves the marriage and allows each party to remarry
ga: Colscaradh amháin a chuireann deireadh leis an bpósadh agus a fhágann an bheirt saor le hathphósadh

source: In specific circumstances, a court can grant a nullity decree
ga: I gcúinsí faoi leith, is féidir le cúirt ordú neamhní a cheadú

source: The effect of a nullity decree is that the court determines that no marriage ever existed
ga: Sa chás seo tá an chúirt ag rá nach raibh aon phósadh ann ariamh

source: The law in relation to nullity is complex, and you should always seek legal advice to assess whether the circumstances exist for a nullity application
ga: Tá an dlí a bhaineann le pósadh a chur ar neamhní fíorchasta, agus ní mór comhairle dlí a fháil i gcónaí le cinneadh a dhéanamh an bhfuil cás ann iarratas ar an bpósadh a chur ar neamhní a dhéanamh

source: A Roman Catholic church annulment has no legal effect
ga: Níl aon stádas dleathúil ag ordú ón Eaglais Chaitliceach pósadh a chur ar neamhní
